    CREATE DATABASE IF NOT EXISTS address_db
    DEFAULT CHARACTER SET utf8mb4
    COLLATE utf8mb4_thai_520_w2;

    CREATE USER IF NOT EXISTS 'db_user'@'%' IDENTIFIED BY 'db_pw';
    GRANT ALL PRIVILEGES ON address_db.* TO 'db_user'@'%';
    FLUSH PRIVILEGES;

    USE address_db;
    
    CREATE TABLE `address` (
      `id` int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
      `fullname` varchar(250) NOT NULL,
      `gender` varchar(10) NOT NULL,
      `birthdate` date NOT NULL,
      `occupation` varchar(250) NOT NULL,
      `address` text NOT NULL,
      `province` varchar(100) NOT NULL,
      `phone` varchar(50) NOT NULL
    ) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_thai_520_w2;

    INSERT INTO `address` (`id`, `fullname`, `gender`, `birthdate`, `occupation`, `address`, `province`, `phone`) VALUES
    (1, 'ชิดชนก เยาวธนโชค', 'ชาย', '2006-03-30', 'อื่น ๆ', '7/7 ถ.ไชยภา ท่าเรือ ป้อมปราบศัตรูพ่าย กระบี่ 84390', 'กระบี่', '0 915 000 806'),
    (2, 'อุดมลักษณ์ ทองอยู่', 'หญิง', '2003-08-31', 'นักศึกษา', '7/8 ถนนนิษประปัญจ์ เนินขามเล็ก แก้งคร้อ ราชบุรี 91240', 'ราชบุรี', '0-2586-8344'),
    (3, 'วรรณรัตน์ ไสยกิจ', 'หญิง', '1988-08-26', 'ธุรกิจส่วนตัว', '3/6 ถ.ทรัพย์ธำรงค์ ต.เขากอบเหนือ อ.สะพานสูง จ.แม่ฮ่องสอน 27810', 'แม่ฮ่องสอน', '062 865 7070'),
    (4, 'ปิยนุช ร่มธิติรัตน์', 'ชาย', '1996-02-09', 'นักศึกษา', '2 ซ.ปรีชากุลเศรษฐ์ ภูเขียว สุพรรณบุรี 93680', 'สุพรรณบุรี', '0 4957 4890'),
    (5, 'มนรัตน์ เลขะพันธุ์', 'ชาย', '2004-08-29', 'ธุรกิจส่วนตัว', '83 หมู่ 6 ถนนทรัพย์ธำรงค์ อ.พรเจริญ สุราษฎร์ธานี 48670', 'สุราษฎร์ธานี', '+66 (0) 856 508 899'),
    (6, 'อภิลักษณ์ นาคะนคร', 'ชาย', '1956-03-04', 'ธุรกิจส่วนตัว', '92 หมู่ 1 ถนนหนักแน่น อำเภอภาษีเจริญ จังหวัดจันทบุรี 20700', 'จันทบุรี', '0 643 419 254'),
    (7, 'นัฐพล ดุริยพันธุ์', 'ชาย', '1971-08-21', 'อื่น ๆ', '475/77 ถนนทศโยธิน อ.เขาสมิง ราชบุรี 44140', 'ราชบุรี', '+66 983 960 306'),
    (8, 'เขียว บินดี', 'หญิง', '1965-03-04', 'นักศึกษา', '38 หมู่ 7 ถนนเขียวขุ้ย อำเภอนาทม หนองบัวลำภู 66040', 'หนองบัวลำภู', '02 304 1144'),
    (9, 'สุทกร นวลเพ็ง', 'ชาย', '1971-06-11', 'อื่น ๆ', '39 หมู่ 72 ถนนถาวรายุศม์ ตำบลห้วยยอด อำเภอบ้านแพง อำนาจเจริญ 47160', 'อำนาจเจริญ', '+66 4870 5964'),
    (10, 'ธีรวุฒิ ตะละภัฏ', 'หญิง', '1976-07-28', 'พนักงานบริษัท', '63/4 ถ.สาระพันธ์ อำเภอปากคาด จังหวัดภูเก็ต 97830', 'ภูเก็ต', '0 2012 2283'),
    (11, 'เพ็ญพรรษา ถะเกิงชศ', 'ชาย', '1995-02-11', 'อื่น ๆ', '55/1 ถนนหนักแน่น อ.ป้อมปราบศัตรูพ่าย สมุทรปราการ 39810', 'สมุทรปราการ', '+66 (0) 4061 6225'),
    (12, 'ทองสิริ นาคพันธุ์', 'หญิง', '1979-12-30', 'ธุรกิจส่วนตัว', '14 หมู่ 54 ถนนถนัดกลึง บางไผ่ใต้ เกษตรสมบูรณ์ อุทัยธานี 11610', 'อุทัยธานี', '+66 (0) 803 396 217'),
    (13, 'เบญญาทิพย์ ติระคมน์', 'ชาย', '1965-01-31', 'รับราชการ', '68/48 ถ.ถนัดอาวุธ อ.เนินสง่า จ.นนทบุรี 60000', 'นนทบุรี', '064-957-6561'),
    (14, 'สุภัทริดา ถนิมมาศ', 'ชาย', '1995-03-14', 'ธุรกิจส่วนตัว', '43 ต.ปากแจ่มใหม่ อ.เมือง สงขลา 64280', 'สงขลา', '0 3433 5141'),
    (15, 'ไชยภพ นิระหานี', 'ชาย', '1993-05-09', 'ธุรกิจส่วนตัว', '40/52 ถ.นับเนื่องนอ บ่อหนองอิเฒ่า ชัยนาท 99990', 'ชัยนาท', '023 303614'),
    (16, 'พัชรีนิษฐ์ ฉายแสง', 'ชาย', '1955-09-25', 'พนักงานบริษัท', '77/2 ถนนพรสีมา พะโต๊ะเล็ก นครพนม 32250', 'นครพนม', '+664 189 4232'),
    (17, 'ภาสินี ถนัดอาวุธ', 'ชาย', '1996-09-12', 'รับราชการ', '4 ถ.จ้อยนุแสง อำเภอห้วยขวาง จังหวัดปทุมธานี 51760', 'ปทุมธานี', '05 487 8706'),
    (18, 'นัสรุน ถนอมกุลบุตร', 'หญิง', '1987-04-30', 'อื่น ๆ', '00 หมู่ 59 ถ.ดาวอร่าม ท่าเรือ พรเจริญ ระนอง 39130', 'ระนอง', '0 5028 5873'),
    (19, 'ราชันทร์ ธรรมฤดี', 'หญิง', '2001-01-06', 'รับราชการ', '58/94 ถนนฉัพพรรณธนกูร อำเภอศรีสงคราม แม่ฮ่องสอน 38340', 'แม่ฮ่องสอน', '+664 485 2791'),
    (20, 'สิริลัดดา นาถะเดชะ', 'หญิง', '1989-03-30', 'อื่น ๆ', '4 ถนนนะวะมันดร หนอกจอก กาฬสินธุ์ 86560', 'กาฬสินธุ์', '052 808141'),
    (21, 'พาสุข ศาสตร์ศิลป์', 'ชาย', '1959-12-19', 'ธุรกิจส่วนตัว', '9 ต.บ้านบางกุ้ง อ.เทพสถิต ลำพูน 46660', 'ลำพูน', '+663 572 9731'),
    (22, 'ณิชนันท์ นกทอง', 'หญิง', '1982-01-18', 'ธุรกิจส่วนตัว', '368/03 ถ.เขียวขุ้ย ต.หนองช้างแล่น อ.แม่ลาว จ.นนทบุรี', 'นนทบุรี', '+66 (0) 3428 3449'),
    (23, 'ลัดดา นุชแนวนุ่ม', 'หญิง', '1984-08-24', 'อื่น ๆ', '57 หมู่ 6 ถ.นักรบ อำเภอนาแก จังหวัดนนทบุรี 51010', 'นนทบุรี', '+66 7084 2185'),
    (24, 'หรรษธร ธัญเสถียร', 'ชาย', '2000-05-10', 'ธุรกิจส่วนตัว', '177 ถนนทองประดิฐ ต.ในเตา อ.วังยาง จ.ชุมพร 76380', 'ชุมพร', '+66 2498 3798'),
    (25, 'อเนชา บุณยะภาชน์', 'ชาย', '2002-09-24', 'พนักงานบริษัท', '279/83 หมู่บ้านวีระวัฒน์ เฉลิมพระเกียรติ กระบี่ 79660', 'กระบี่', '049917340'),
    (26, 'พรพิไล นำธวัช', 'หญิง', '1964-11-21', 'รับราชการ', '219/05 ถ.ทองสินธุ์ บ้านปังหวาน สกลนคร 57270', 'สกลนคร', '050 481961'),
    (27, 'เจษฎากร นิลวิมล', 'ชาย', '1984-05-18', 'ธุรกิจส่วนตัว', '64 ถนนตั้งเผ่า หนองปลาหมอ ซับใหญ่ สระบุรี 67880', 'สระบุรี', '0602484593'),
    (28, 'ชรินทร์ทิพย์ ทองประดิฐ', 'หญิง', '1965-12-31', 'อื่น ๆ', '53 หมู่ 49 ถ.เขียวขุ้ย อ.พระนคร ระนอง 66340', 'ระนอง', '031297929'),
    (29, 'อมัด ธูปะวิโรจน์', 'หญิง', '1965-04-30', 'พนักงานบริษัท', '5/4 ถนนบัวเผื่อน ตำบลนาวง อำเภอเนินสง่า บึงกาฬ 75710', 'บึงกาฬ', '092 009 0307'),
    (30, 'วิชา นิลสลัว', 'ชาย', '1972-12-14', 'นักศึกษา', '36 ถนนทวนทอง ตำบลนาดี อำเภอเวียงแก่น สกลนคร 99630', 'สกลนคร', '+665 457 9131');

    CREATE TABLE IF NOT EXISTS users (
      id INT AUTO_INCREMENT PRIMARY KEY,
      username VARCHAR(50) NOT NULL UNIQUE,
      password VARCHAR(255) NOT NULL
    );

    INSERT INTO users (username, password) VALUES ('admin', 'adminpass');